# 한번에 1/2칸 뛰기 가능
# 4칸 -> 5가지 방법 % 1234567
# (1,1,1,1) # 3칸만들기+ 1
# (1,2,1) # 3칸만들기+ 1
# (2,1,1) # 3칸만들기+ 1
# (1,1,2) # 2칸만들기+ 2
# (2,2) # 2칸만들기+ 2
# 3칸 -> 3방법
# (1,1,1) # 2칸만들기+ 1
# (2,1) # 2칸만들기+ 1
# (1,2) # 1칸 만들기+ 2
# 2칸 -> 2방법
# (1,1) # 1칸만들기+ 1
# (2) # 0칸만들기+ 2
# 1칸 -> 1방법
# (1)
# 직접 두 값만 필요->배열말고, 변수 2개로 둘 수 있음
# python multiple 할당 잘 사용하자!!!!!!!!!!!
def solution(n):
    dp = [0]*(n+1)
    dp[1] = 1
    if n>1: dp[2] = 2
    for i in range(3, n+1):
        dp[i] = dp[i-1] + dp[i-2]
    answer = dp[n] % 1234567
    return answer
'''
def solution(num):
    a, b = 1, 2
    for i in range(2,num):
        a, b = b, a+b
    return b if num > 1 else 1
'''